export function getEmotion(quizAns) {
  switch (quizAns[0]) {
    case "A":
      return [
        "悲傷",
        "sad",
        "有一種悲傷～是笑著與你分開思念卻背對背張望～哭啊、喊阿～好好的擁抱自己吧，這無關對錯，只是情緒的出口，請相信你的世界仍充滿絢麗的陽光，那些過不去的坎…..都是因為你腿短。",
        "原本想一口一口吃掉憂愁，不料卻一口一口吃成胖子。",
      ];
    case "B":
      return [
        "無感",
        "feel nothing",
        "人生百態，笑笑看待，我們做人啊，要記得及時行樂，天天快樂，多買可樂。在這座城市，誰先認真，誰就輸了，古人說：自殺不能解決問題，但裝死可以：））",
        "生活就像鴨子游水，別人只看水面悠閒的樣子，沒人知道水下的雙腳有多拼命。每個人都只是在不動聲色地努力罷了。",
      ];
    case "C":
      return [
        "恐懼",
        "fear",
        "不哭不哭眼淚是珍珠，越哭越像豬～做惡夢不怕不怕，最怕的是走建國路回家但後座少ㄌ泥！經過惡夢的洗禮恭喜你成功挺ㄌ過來，你「兵來將擋、水來土掩」，生活中的挫折都無法將你輕易打敗～試著傾聽自己內心的聲音，不要逃避也不要害怕，你會成為更好的自己。",
      ];
    case "D":
      return [
        "性歡愉",
        "sexual pleasure",
        "對你的愛，不只說說，因為剩下….都用做的。👌 💦 🍑今晚，我要你愛，我要你為了我變壞，如果可以，只想和你…回到那天相遇。",
        "愛情，笑起來很甜，嚐起來很鹹。",
        "白天只想讓你…心上有我，夜晚也想讓你身上有我。",
        "脫了衣服我是禽獸，穿上衣服我是衣冠禽獸！",
      ];
    case "E":
      return [
        "厭惡",
        "disgust",
        "面對討厭的人事物，唯一的解決辦法就是….讓他更討厭你🤪，物極必反、負負得正、愛拼才會贏。",
      ];
    case "F":
      return [
        "憤怒",
        "angry",
        "別惹我，否則我會讓你死得很有節奏感。媽媽說：讀書是為了心平氣和地跟傻逼說話，而健身是為了讓傻逼心平氣和地跟你說話。現在我明白了，謝謝那些曾經擊倒我的人，躺著真舒服。",
      ];
    case "G":
      return [
        "驚嚇",
        "terrified",
        "兄弟你說 ：你若不勇敢，誰替你堅強？當時，真的是害怕吉了， 要記住！情況越嚴重，越困難，就越需要堅定，別亂了陣腳。",
        "為什麼要怕鬼，害你的全是人。 人只要不失去方向，就不會失去自己！人生重要的不是所站的位置，而是所朝的方向。",
      ];
    case "H":
      return [
        "幸福滿足",
        "happy satisfied",
        "最近的你生活順利滿福堡、心靈富足比奇堡，樂悠悠的快樂好比海綿寶寶跟派大星，至於章魚哥？算了吧。保持你的好心情和正能量，沒事多喝水，多喝水沒事…",
      ];
  }
}

export function getCharacter(quizAns, otherAns) {
  if (quizAns[1] === "1") {
    if (otherAns[1] === "myself") {
      return [
        "人",
        "people",
        "要好好愛自己，因為沒有人會愛你，夢見那個始終不離不棄的你，好好享受孤獨吧。一個人想著一個人，到頭來才發現，原來最長的戀愛，叫自戀。",
      ];
    } else if (otherAns[1] === "strangers") {
      return [
        "人",
        "people",
        "想念是會呼吸的痛，相信夢到的那個他在你的生命中佔了一席之地，人生的旅途一路顛簸，有人留下、有人離開，但這些都是為了讓你成為更完整、更完美的人。所以愛我別走～希望你愛的那個他都能留在你身邊。",
      ];
    } else if (otherAns[1] === "acquaintance") {
      return [
        "人",
        "people",
        "有些人跟牛排一樣，不要太熟比較好，來衝衝去衝衝，轟隆轟隆，別為了不屬於你的觀眾，演了一段你根本不喜歡的人生。",
      ];
    } else if (otherAns[1] === "significant other") {
      return [
        "人",
        "people",
        "對你而言，最遠的不是沒有緣分，而是從熟識變得陌生，對我而言，最遙遠的距離是他媽的星期一到星期五💩",
        "我喜歡你，就像你媽打你……不講道理。",
      ];
    }
  } else if (quizAns[1] === "2") {
    if (otherAns[1] === "positive") {
      return [
        "鬼神",
        "ghost",
        "R們R們，上帝關上一扇門，必定開啟一扇窗，讓你跳下去。日子過得好苦呀～靜下來多留意身旁的人事物，走走平時不會走的路，就算跌倒，也要豪邁地笑，是驚喜、是驚嚇？下一個轉角是什麼？拐個彎，搞不好幸運小精靈就在你身邊。",
      ];
    } else if (otherAns[1] === "negative") {
      return [
        "鬼神",
        "ghost",
        "夜路走多，總會遇到鬼😨，原來那不是別人，是藏在我們內心的魔鬼，總在夜闌人靜的時候跑出來，讓我們變得脆弱、不安。歇會歇會吧～～生活是否覺得疲憊了？那就對了！因為舒服是負責留給有錢人的🤭，笑一個吧，快樂快樂才叫做意義！",
      ];
    }
  } else if (quizAns[1] === "3") {
    if (otherAns[1] === "threatening") {
      return [
        "不存在的生物",
        "undefined mysterious animal",
        "有怪獸、大怪獸，一直纏著我～被生活壓的喘不過氣的你是不是要netflix and chill一下？現實生活就像是寶可夢ㄉ世界，面對火箭隊來勢洶洶ㄉ進擊，或許你需要一隻皮卡丘來跟你並肩作戰！試著讓自己放鬆一下吧！",
      ];
    } else if (otherAns[1] === "not threatening") {
      return [
        "不存在的生物",
        "undefined mysterious animal",
        "面對外物的紛紛擾擾，我不會眼睜睜讓你去送死，我會閉上眼睛。老話說得好呀：心靜則清，心清則明，當心真正沉靜下來之後，生活隨即而來也將變得輕鬆隨性。",
      ];
    }
  } else if (quizAns[1] === "4") {
    return ["動物", "animal", "動物是人類最好的朋友，從小我就開始培養最穩固的友誼，名叫侯友宜。"];
  }
}

export function getLifeStyle(quizAns) {
  switch (quizAns[2]) {
    case "X":
      return [
        "自然現象",
        "natural",
        "世界上最寬闊的是海洋，比海洋更寬闊的是天空，在這大自然中，自然而然地忘卻生活中所有的不愉快，腦海裡滋生出許多美好的想法，心底也覺得像大海一樣很寬、很寬……宰相肚裡能撐船，而我撐的卻是整座食堂，人生苦短，再來給我三百碗…..",
      ];
    case "Y":
      return [
        "日常生活",
        "normal",
        "人生苦短，必須性感，每天來點儀式感。偶爾為生活添加一些樂子，替平凡加入一點美麗的藥水💦",
        "早起可以做很多事，比如說再睡個回籠覺。",
        "一早醒來我以為我長大了，原來是被子蓋橫了。",
        "不要放棄你的夢！繼續睡！棉被以外的地方，都是遠方，請先不要叫我起床。成人的世界除了長胖，一切都不容易。",
      ];
    case "Z":
      return [
        "小說情節",
        "novel",
        "想像力就是你的超能力，奶油獅都沒你這麼有創意！BLACKPINK的演唱會規模都不及你腦內的派對，天馬行空的你總是有機靈古怪的想法，有想法就去衝！get ‘em get ‘em",
        "很喜歡你的愚蠢，總是那麼富有想像力。",
      ];
  }
}
